In [2]:
# 판다스는 데이터 분석 라이브러리 => 파이썬계의 엑셀
    # 데이터 테이블을 다루기 위한 도구로 가장 적합

# 판다스는 넘파이를 기본적으로 사용, 배열을 더 효율적으로 사용하기 위한 인덱싱, 연산, 전처리 등의 다양한 함수 제공
    # 판다스는 데이터 테이블의 형태인 2차원 데이터를 다룸
# 데이터프레임 : 데이터 테이블 전체를 다루는 객체
# 시리즈 : 각각의 열 데이터를 다루는 객체

from pandas import Series, DataFrame
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
# 시리즈 객체를 생성하면 기본적으로 세 가지 요소인 데이터, 인덱스, 데이터 타입이 생성됨
    # 데이터 : 기존 다른 객체처럼 값을 저장하는 요소
    # 인덱스 : 인덱스는 항상 0부터 시작, 숫자로만 할당하지만
        # 시리즈 객체에서는 숫자 외에도 문자열, 0외의 다른 값으로 시작하는 숫자, 순서가 일정하지 않은 숫자 입력 가능
            # 데이터를 다룰 때 데이터의 아이디 값을 인덱스로 삼아야 할 때가 있기 때문
        # 시리즈 객체에서는 인덱스 값의 중복을 허용함
    # 데이터 타입 : 정확히 넘파이의 데이터 타입과 일치
        # 넘파이의 데이터 타입을 그대로 시리즈 객체에도 적용

import pandas as pd
import numpy as np

from pandas import Series, DataFrame

list_data = [1, 2, 3, 4, 5]
lise_name = ['a', 'b', 'c', 'd', 'e']
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
example_obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [6]:
type(example_obj.values)    # 넘파이 배열 타입

numpy.ndarray

In [8]:
example_obj.dtype   # 넘파이의 데이터 타입과 동일

dtype('int64')

In [9]:
example_obj.name = 'number'
example_obj.index.name = 'id'
example_obj

id
a    1
b    2
c    3
d    4
e    5
Name: number, dtype: int64

In [10]:
# 시리즈 객체를 생성하는 가장 일반적인 방법은 데이터프레임 객체 생성 후 각 열에서 시리즈 객체를 뽑는 것
    # 하지만 이외에도 다양한 시퀀스형 데이터 타입에 대해 저장 가능
        # 다음 코드와 같이 딕셔너리 타입으로 생성됨
            # 키는 인덱스, 값은 데이터 항목

dict_data = {"a" : 1, "b" : 2, "c" : 3, "d" : 4, "e" : 5}
example_obj = Series(dict_data, dtype= np.float32, name= "example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [11]:
# 일반적으로 판다스의 모든 객체는 인덱스 값을 기준으로 생성
    # 데이터 값이 없을 때 인덱스를 추가한다면 해당 값들은 NaN(Not a Number)가 출력
        # 일반적으로 NaN은 Null값을 의미하며, 파이썬에서는 'None'을 의미

dict_data_1 = {"a" : 1, "b" : 2, "c" : 3, "d" : 4, "e" : 5}
indexes = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
series_obj_1 = Series(dict_data_1, index= indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [12]:
# 데이터프레임 객체는 데이터 테이블 전체를 지칭하는 객체
    # 여러 개의 시리즈 묶음으로 구성되어있음
# 기본적으로 데이터프레임 객체는 통계 분석 언어인 R을 이용하여 만들어짐
# 시리즈의 묶음 => 넘파이 배열의 특성을 그대로 가지고 있는 객체
    # 차이는 각 열 별로 데이터 타입이 다르다는 것
        # 각 데이터 타입을 그대로 유지하면서 합쳐주는 형태이기 때문
# 열과 행을 각각 사용해서 하나의 데이터에 접근하는 인덱싱이 가능
# 2차원 매트릭스 기반으로 만들어짐
    # 열 단위로 같은 인덱스의 개수만큼 데이터가 추가됨

In [13]:
# 가장 기본적으로 데이터프레임을 생성하는 방법 : 스프레드시트형 파일에서 데이터를 바로 로딩하는 것
    # 'read_확장자' 형태의 함수를 사용할 수 있음
    # 자신이 가진 데이터에 따라 다양한 기법을 사용하여 호출 가능

data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
# 데이터 URL을 변수에 넣기
df_data = pd.read_csv(data_url, sep= '\s+', header= None)   # csv 데이터 로드

df = pd.DataFrame(df_data)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,11.9

In [14]:
# 데이터프레임의 생성
# 이외에도 데이터프레임을 직접 만들 수 있음
# 딕셔너리 타입의 데이터에서 키는 열 이름, 값은 시퀀스형 데이터 타입을 넣어 각 열의 데이터로 제작 가능

raw_data = {'first_name' : ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
            'last_name' : ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age' : [42, 52, 36, 24, 73],
            'city' : ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston'],}
df = pd.DataFrame(raw_data, columns= ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [15]:
# 데이터프레임의 열 다루기
# 시리즈 객체에서 가장 중요했던 것이 인덱스였다면, 데이터프레임에서는 이에 더해 열 이름을 선정하는 것이 중요
    # 데이터가 생성될 때 열 이름을 한정한다면 해당 데이터의 열만 추출 가능

DataFrame(raw_data, columns= ['age', 'city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [16]:
# 데이터가 존재하지 않는 열을 추가한다면 해당 열에는 NaN 값들이 추가되어 생성됨

DataFrame(raw_data, columns= ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN